console.log("확인");
/*
실행 컨텍스트와 블록 레벨 스코프
let.const 키워드와 블록 레벨 스코프
var 키워드로 선언한 변수는 오로지 함수의 코드 블록만 지역 스코프로 인정하는 함수
레벨 스코프를 따른다.
하지만 let, const 키워드로 선언한 변수는 모든 코드 블록(함수, if문, for 문, while문 , try/catch 문 등)을 지역 스코프로 인정하는 블록 레벨 스코프를 따른다.*/

// let x = 1;

// if (true) {
//   let x = 10;
//   console.log(x); // 10
// }

// console.log(x); // 1

/*  전역 실행 컨덱스트가 실행되면
블록 렉시컬 환경과 전역 렉시컬 환경이 생성 된다.
if문 블록 스코프 내에 x 값이 10으로 변수 선언과 값 할당이 이루어 지고
실행이 종료가 되면 if문의 코드 블록이 실행되기 이전의 렉시컬 환경으로 되돌려져
전역 변수 x = 1 변수 선언과 값할당이 이루어져 마지막 전역 스코프 실행이 종료될때
x 값이 1로 나오는 것이다.

이는 모든 블록 레벨 스코프를 생성하는 모든 블록문에 적용된다.
*/
